InformationRegisters/КР_ИсторияИзмененияТоварныхОграничений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КР_ИсторияИзмененияТоварныхОграничений</Name>
			<Comment>JIRA№ A2105505-1148</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетодОбеспеченияПотребностей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыОбеспеченияПотребностей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеКоличествоЗапаса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыИзмененияАссортимента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КР_ОтложенныеДействияСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КР_ОтложенныеДействияСистемы</Name>
			<Comment>JIRA№ A2105505-2384</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяМетода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КР_СостоянияВыполненияОтложенныхДействийСистемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапланированнаяДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщенияПользователю</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПопыткиВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ХэшИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КР_ИсторияИзмененияТоварныхОграничений/Ext/RecordSetModule.bsl
////////////////////////////////////////////////////
//// Модуль набора записей регистра сведений "КР_ИсторияИзмененияТоварныхОграничений"
//// Создан: 22.03.2023 Марченко С.Н., КРОК, JIRA№A2105505-1148
//// Разработка по ФДР С31.010, Обработка для формирования заказов по потребностям

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;	
	
	МенеджерВременныхТаблиц = Неопределено; 
	Если Не ДополнительныеСвойства.Свойство("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц) Тогда 
	 	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
        ДополнительныеСвойства.Вставить("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц);
	КонецЕсли;
	
	// Получаем уникальные значения измерений до и при записи по регистраторы
	Регистратор = Отбор.Регистратор.Значение;
	Запрос = Новый Запрос(ТекстЗапросаПередЗаписью());
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	// Помещаем во временную таблицу
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;	                                                       
	
	МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	
	// << 14.10.2023 Марченко С.Н., КРОК, JIRA№A2105505-2384
	// В рамках оптимизации обновление товарных ограницений вынесено в отложенные действия системы
	МенеджерОтложенныхДействийСистемы = РегистрыСведений.КР_ОтложенныеДействияСистемы;
	Регистратор = Отбор.Регистратор.Значение;
	
	// Готовим параметры для регистрации отложенного действия
	Параметры = Новый Массив;
	Параметры.Добавить(Регистратор);
	Параметры.Добавить(МенеджерВременныхТаблиц.Таблицы["ДоИзменения"].ПолучитьДанные().Выгрузить());
	
	Заголовок = НСтр("ru = 'Заполнение товарных ограничений на основании Истории изменений товарных ограничений (%1)'");
	Заголовок = СтрШаблон(Заголовок, Регистратор);  
	
	// Если набор будет обновляться несколько раз до того как выполнится отложенное действие,
	//	запись в обновлять не будем так как в нем сохранено изначальное состояние "контекста"
	//  В конечном итоге мы сразу отразим конечное состояние набора
	ДействиеПриНаличииЗаписи = МенеджерОтложенныхДействийСистемы.ДействиеПриНаличииЗаписи_ОставитьБезИзменений();
	
	// Регистрируем отложенное действие к выполнению
	МенеджерОтложенныхДействийСистемы.ЗапланироватьДействиеСистемы(
		"РегистрыСведений.КР_ИсторияИзмененияТоварныхОграничений.ОбновитьТоварныеОграничения",
		Параметры, Заголовок, ТекущаяДатаСеанса(), Регистратор, ДействиеПриНаличииЗаписи);
	
	// >> 14.10.2023 Марченко С.Н., КРОК, JIRA№A2105505-2384

КонецПроцедуры

#КонецОбласти	

#Область ТекстыЗапросов

Функция ТекстЗапросаПередЗаписью()
	
	Возврат
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Склад КАК Склад,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ДоИзменения
	|ИЗ
	|	РегистрСведений.КР_ИсторияИзмененияТоварныхОграничений КАК Т
	|ГДЕ
	|	Т.Регистратор = &Регистратор";

КонецФункции	

#КонецОбласти

#КонецЕсли
